tests/results/comprehensive_stress_test_results/light_load.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sfdaas/api/propagate?t0=2010-05-28T12:00:00.000%2B00:00&tf=2010-05-29T12:00:00.000%2B00:00&r0=%5B3198022.67,2901879.73,5142928.95%5D&v0=%5B-6129.640631,4489.647187,1284.511245%5D
Document Length:        3578 bytes

Concurrency Level:      25
Time taken for tests:   1.160 seconds
Complete requests:      500
Failed requests:        437
   (Connect: 0, Receive: 0, Length: 437, Exceptions: 0)
Total transferred:      1834792 bytes
HTML transferred:       1790792 bytes
Requests per second:    430.91 [#/sec] (mean)
Time per request:       58.017 [ms] (mean)
Time per request:       2.321 [ms] (mean, across all concurrent requests)
Transfer rate:          1544.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0      14
Processing:     4   57  34.0     51     159
Waiting:        4   57  33.9     51     159
Total:          4   57  34.1     51     160

Percentage of the requests served within a certain time (ms)
  50%     51
  66%     69
  75%     83
  80%     89
  90%    104
  95%    120
  98%    136
  99%    148
 100%    160 (longest request)