tests/results/comprehensive_stress_test_results/medium_load.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sfdaas/api/propagate?t0=2010-05-28T12:00:00.000%2B00:00&tf=2010-05-29T12:00:00.000%2B00:00&r0=%5B3198022.67,2901879.73,5142928.95%5D&v0=%5B-6129.640631,4489.647187,1284.511245%5D
Document Length:        3578 bytes

Concurrency Level:      50
Time taken for tests:   2.876 seconds
Complete requests:      1000
Failed requests:        970
   (Connect: 0, Receive: 0, Length: 970, Exceptions: 0)
Total transferred:      3670232 bytes
HTML transferred:       3582232 bytes
Requests per second:    347.70 [#/sec] (mean)
Time per request:       143.803 [ms] (mean)
Time per request:       2.876 [ms] (mean, across all concurrent requests)
Transfer rate:          1246.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       3
Processing:     4  141  61.8    141     388
Waiting:        2  141  61.8    141     388
Total:          4  141  61.7    141     388

Percentage of the requests served within a certain time (ms)
  50%    141
  66%    167
  75%    185
  80%    197
  90%    222
  95%    240
  98%    261
  99%    280
 100%    388 (longest request)